import { Homework } from "../Model/HomeWork.js";

export const homeworkTable = [
    new Homework(1, 1, "2025-02-01", "2025-02-05", "Вивчити основи JavaScript"),
    new Homework(2, 2, "2025-02-02", "2025-02-06", "Розв’язати задачі з масивами"),
    new Homework(3, 3, "2025-02-03", "2025-02-07", "Підготувати презентацію з HTML"),
    new Homework(4, 1, "2025-02-04", "2025-02-08", "Написати просту веб-сторінку"),
    new Homework(5, 4, "2025-02-05", "2025-02-10", "Опрацювати CSS Flexbox"),
    new Homework(6, 2, "2025-02-06", "2025-02-11", "Реалізувати калькулятор на JS"),
    new Homework(7, 5, "2025-02-07", "2025-02-12", "Підготувати конспект з React"),
    new Homework(8, 3, "2025-02-08", "2025-02-13", "Зробити верстку макета"),
    new Homework(9, 6, "2025-02-09", "2025-02-14", "Написати CRUD-операції"),
    new Homework(10, 4, "2025-02-10", "2025-02-15", "Підготуватися до контрольної роботи")
];
